api/app/wsdl/MsbMorService.xml

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="MsbMorService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://tempuri.org/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsdl:types><xsd:schema targetNamespace="http://tempuri.org/Imports"><xsd:import schemaLocation="./MsbMorService_xsd0.xml" namespace="http://tempuri.org/"/><xsd:import schemaLocation="./MsbMorService_xsd1.xml" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xsd:import schemaLocation="./MsbMorService_xsd2.xml" namespace="http://schemas.datacontract.org/2004/07/Msb.Extern.Services.MsbMorServiceProxy"/><xsd:import schemaLocation="./MsbMorService_xsd3.xml" namespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xsd:import schemaLocation="./MsbMorService_xsd4.xml"/></xsd:schema></wsdl:types><wsdl:message name="IService_AanmakenMelding_InputMessage"><wsdl:part name="parameters" element="tns:AanmakenMelding"/></wsdl:message><wsdl:message name="IService_AanmakenMelding_OutputMessage"><wsdl:part name="parameters" element="tns:AanmakenMeldingResponse"/></wsdl:message><wsdl:message name="IService_MeldingVolgen_InputMessage"><wsdl:part name="parameters" element="tns:MeldingVolgen"/></wsdl:message><wsdl:message name="IService_MeldingVolgen_OutputMessage"><wsdl:part name="parameters" element="tns:MeldingVolgenResponse"/></wsdl:message><wsdl:message name="IService_MeldingenOpvragen_InputMessage"><wsdl:part name="parameters" element="tns:MeldingenOpvragen"/></wsdl:message><wsdl:message name="IService_MeldingenOpvragen_OutputMessage"><wsdl:part name="parameters" element="tns:MeldingenOpvragenResponse"/></wsdl:message><wsdl:portType name="IService"><wsdl:operation name="AanmakenMelding"><wsdl:input wsaw:Action="http://tempuri.org/IService/AanmakenMelding" message="tns:IService_AanmakenMelding_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService/AanmakenMeldingResponse" message="tns:IService_AanmakenMelding_OutputMessage"/></wsdl:operation><wsdl:operation name="MeldingVolgen"><wsdl:input wsaw:Action="http://tempuri.org/IService/MeldingVolgen" message="tns:IService_MeldingVolgen_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService/MeldingVolgenResponse" message="tns:IService_MeldingVolgen_OutputMessage"/></wsdl:operation><wsdl:operation name="MeldingenOpvragen"><wsdl:input wsaw:Action="http://tempuri.org/IService/MeldingenOpvragen" message="tns:IService_MeldingenOpvragen_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService/MeldingenOpvragenResponse" message="tns:IService_MeldingenOpvragen_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IService" type="tns:IService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="AanmakenMelding"><soap:operation soapAction="http://tempuri.org/IService/AanmakenMelding" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="MeldingVolgen"><soap:operation soapAction="http://tempuri.org/IService/MeldingVolgen" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="MeldingenOpvragen"><soap:operation soapAction="http://tempuri.org/IService/MeldingenOpvragen" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="MsbMorService"><wsdl:port name="BasicHttpBinding_IService" binding="tns:BasicHttpBinding_IService"><soap:address location="https://webservices-acc.rotterdam.nl/Msb.Extern.Services/MsbMorService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>
